In [28]:
import pandas as pd
df_csv=pd.read_csv("C:\\Users\\user\\Downloads\\Sample1 (1) (1).csv")
df_excel=pd.read_excel("C:\\Users\\user\\Downloads\\Sample2 (2) (1).xlsx")
print(df_csv,df_excel)

  Company_name             Model Name Fuel Type Body Style  Car Length
0          BMW  2 serie Active Tourer     Disel  Hatchback        4360
1        Tesla               3 Series       Gas      Sedan        4324
2      Porsche                     X3     Disel      Sedan        4433
3        Porsh                     X4     Disel  Crossover        4612
4       Maruti                     X6       Gas  Crossover        4831
5        Volvo                    Z3M      Gas       Coupe        4025
6      Ferrari                     Z4     Disel   Roadster        4239
7        Audi                  Toyota    Petrol      Coupe        4033
8       Suzuki                  Swift    Petrol  Hatchback        4320   Company_name Model Name  On road Price Loan Ammount  Monthly Emi  \
0          BMW          X4           44L          30L      12000.0
1         Audi     series2           42L          28L       7500.0
2      Porsche     Cayenne           56L          45L      20000.0
3        Volvo     strives           40L          29L      11000.0
4      Ferrari      xteria           80L          50L      13000.0
5       Maruti       swift           20L          NaN       6000.0
6        Porsh       Selia           49L          NaN      11000.0
7        Tesla     speria1           37L          28L          NaN
8          Kia      delite           22L          NaN      14000.0

  Interest Rate  Monthly Principle  Monthly Interest
0          9.4%              40000               NaN
1         0.088              14000               NaN
2        0.0832              24000            1280.0
3           NaN              45000            1100.0
4           NaN              56000            1640.0
5         0.074              35000            1140.0
6         0.096              33000            3600.0
7         0.081              42000               NaN
8           NaN              15000            2500.0

In [55]:
merge_df=pd.merge(df_csv,df_excel,on='Company_name')
print(merge_df)

  Company_name             Model Name Fuel Type Body Style  Car Length  \
0          BMW  2 serie Active Tourer     Disel  Hatchback        4360
1        Tesla               3 Series       Gas      Sedan        4324
2      Porsche                     X3     Disel      Sedan        4433
3        Porsh                     X4     Disel  Crossover        4612
4       Maruti                     X6       Gas  Crossover        4831
5        Volvo                    Z3M      Gas       Coupe        4025
6      Ferrari                     Z4     Disel   Roadster        4239

  Model Name  On road Price Loan Ammount  Monthly Emi Interest Rate  \
0          X4           44L          30L      12000.0          9.4%
1     speria1           37L          28L          NaN         0.081
2     Cayenne           56L          45L      20000.0        0.0832
3       Selia           49L          NaN      11000.0         0.096
4       swift           20L          NaN       6000.0         0.074
5     strives           40L          29L      11000.0           NaN
6      xteria           80L          50L      13000.0           NaN

   Monthly Principle  Monthly Interest
0              40000               NaN
1              42000               NaN
2              24000            1280.0
3              33000            3600.0
4              35000            1140.0
5              45000            1100.0
6              56000            1640.0

In [56]:
merge_df = merge_df.fillna(0)
print(merge_df)

  Company_name             Model Name Fuel Type Body Style  Car Length  \
0          BMW  2 serie Active Tourer     Disel  Hatchback        4360
1        Tesla               3 Series       Gas      Sedan        4324
2      Porsche                     X3     Disel      Sedan        4433
3        Porsh                     X4     Disel  Crossover        4612
4       Maruti                     X6       Gas  Crossover        4831
5        Volvo                    Z3M      Gas       Coupe        4025
6      Ferrari                     Z4     Disel   Roadster        4239

  Model Name  On road Price Loan Ammount  Monthly Emi Interest Rate  \
0          X4           44L          30L      12000.0          9.4%
1     speria1           37L          28L          0.0         0.081
2     Cayenne           56L          45L      20000.0        0.0832
3       Selia           49L            0      11000.0         0.096
4       swift           20L            0       6000.0         0.074
5     strives           40L          29L      11000.0             0
6      xteria           80L          50L      13000.0             0

   Monthly Principle  Monthly Interest
0              40000               0.0
1              42000               0.0
2              24000            1280.0
3              33000            3600.0
4              35000            1140.0
5              45000            1100.0
6              56000            1640.0

In [57]:
print("After adding 18% Gst to On road Price:-")
for index, row in merge_df.iterrows():
    on_road_price = merge_df.at[index, 'On road Price']
    on_road_price = float(on_road_price.replace(',', '').rstrip('L'))
    on_road_price_taxed = on_road_price * 1.18
    merge_df.at[index, 'On road Price'] = '{:,.2f} L'.format(on_road_price_taxed)

print(merge_df)

After adding 18% Gst to On road Price:-
  Company_name             Model Name Fuel Type Body Style  Car Length  \
0          BMW  2 serie Active Tourer     Disel  Hatchback        4360
1        Tesla               3 Series       Gas      Sedan        4324
2      Porsche                     X3     Disel      Sedan        4433
3        Porsh                     X4     Disel  Crossover        4612
4       Maruti                     X6       Gas  Crossover        4831
5        Volvo                    Z3M      Gas       Coupe        4025
6      Ferrari                     Z4     Disel   Roadster        4239

  Model Name  On road Price Loan Ammount  Monthly Emi Interest Rate  \
0          X4       51.92 L          30L      12000.0          9.4%
1     speria1       43.66 L          28L          0.0         0.081
2     Cayenne       66.08 L          45L      20000.0        0.0832
3       Selia       57.82 L            0      11000.0         0.096
4       swift       23.60 L            0       6000.0         0.074
5     strives       47.20 L          29L      11000.0             0
6      xteria       94.40 L          50L      13000.0             0

   Monthly Principle  Monthly Interest
0              40000               0.0
1              42000               0.0
2              24000            1280.0
3              33000            3600.0
4              35000            1140.0
5              45000            1100.0
6              56000            1640.0

In [4]:
import pandas as pd
titanic_data=pd.read_csv("C:\\Users\\user\\Desktop\\datasets-master\\datasets-master\\titanic.csv")
print(titanic_data.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [5]:
age_data=titanic_data["Age"]
print(age_data.head())

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [7]:
age_sex=titanic_data[["Age","Sex"]]

In [8]:
print(age_sex.head())

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [9]:
print(age_sex.shape)

(891, 2)

In [10]:
age_26=titanic_data[titanic_data["Age"]>26]
print(age_26)

     PassengerId  Survived  Pclass  \
1              2         1       1
3              4         1       1
4              5         0       3
6              7         0       1
8              9         1       3
..           ...       ...     ...
881          882         0       3
883          884         0       2
885          886         0       3
886          887         0       2
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
6                              McCarthy, Mr. Timothy J    male  54.0      0
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
..                                                 ...     ...   ...    ...
881                                 Markun, Mr. Johann    male  33.0      0
883                      Banfield, Mr. Frederick James    male  28.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
6        0             17463  51.8625   E46        S
8        2            347742  11.1333   NaN        S
..     ...               ...      ...   ...      ...
881      0            349257   7.8958   NaN        S
883      0  C.A./SOTON 34068  10.5000   NaN        S
885      5            382652  29.1250   NaN        Q
886      0            211536  13.0000   NaN        S
890      0            370376   7.7500   NaN        Q

[395 rows x 12 columns]

# Is present in dataset or not

In [11]:
ade_26=titanic_data["Age"]>26

In [13]:
print(ade_26)

0      False
1       True
2      False
3       True
4       True
       ...
886     True
887    False
888    False
889    False
890     True
Name: Age, Length: 891, dtype: bool

In [14]:
print(titanic_data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [17]:
class_23=titanic_data[titanic_data["Pclass"].isin([2])]
print(class_23)

     PassengerId  Survived  Pclass  \
9             10         1       2
15            16         1       2
17            18         1       2
20            21         0       2
21            22         1       2
..           ...       ...     ...
866          867         1       2
874          875         1       2
880          881         1       2
883          884         0       2
886          887         0       2

                                             Name     Sex   Age  SibSp  Parch  \
9             Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1      0
15               Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0      0
17                   Williams, Mr. Charles Eugene    male   NaN      0      0
20                           Fynney, Mr. Joseph J    male  35.0      0      0
21                          Beesley, Mr. Lawrence    male  34.0      0      0
..                                            ...     ...   ...    ...    ...
866                  Duran y More, Miss. Asuncion  female  27.0      1      0
874         Abelson, Mrs. Samuel (Hannah Wizosky)  female  28.0      1      0
880  Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0      1
883                 Banfield, Mr. Frederick James    male  28.0      0      0
886                         Montvila, Rev. Juozas    male  27.0      0      0

               Ticket     Fare Cabin Embarked
9              237736  30.0708   NaN        C
15             248706  16.0000   NaN        S
17             244373  13.0000   NaN        S
20             239865  26.0000   NaN        S
21             248698  13.0000   D56        S
..                ...      ...   ...      ...
866     SC/PARIS 2149  13.8583   NaN        C
874         P/PP 3381  24.0000   NaN        C
880            230433  26.0000   NaN        S
883  C.A./SOTON 34068  10.5000   NaN        S
886            211536  13.0000   NaN        S

[184 rows x 12 columns]

In [18]:
age_no_na=titanic_data[titanic_data["Age"].notna()]
print(age_no_na)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
885          886         0       3
886          887         0       2
887          888         1       1
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
885      5            382652  29.1250   NaN        Q
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[714 rows x 12 columns]

In [19]:
age_is_na=titanic_data[titanic_data["Age"].isna()]

In [20]:
print(age_is_na)

     PassengerId  Survived  Pclass                                      Name  \
5              6         0       3                          Moran, Mr. James
17            18         1       2              Williams, Mr. Charles Eugene
19            20         1       3                   Masselmani, Mrs. Fatima
26            27         0       3                   Emir, Mr. Farred Chehab
28            29         1       3             O'Dwyer, Miss. Ellen "Nellie"
..           ...       ...     ...                                       ...
859          860         0       3                          Razi, Mr. Raihed
863          864         0       3         Sage, Miss. Dorothy Edith "Dolly"
868          869         0       3               van Melkebeke, Mr. Philemon
878          879         0       3                        Laleff, Mr. Kristo
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"

        Sex  Age  SibSp  Parch      Ticket     Fare Cabin Embarked
5      male  NaN      0      0      330877   8.4583   NaN        Q
17     male  NaN      0      0      244373  13.0000   NaN        S
19   female  NaN      0      0        2649   7.2250   NaN        C
26     male  NaN      0      0        2631   7.2250   NaN        C
28   female  NaN      0      0      330959   7.8792   NaN        Q
..      ...  ...    ...    ...         ...      ...   ...      ...
859    male  NaN      0      0        2629   7.2292   NaN        C
863  female  NaN      8      2    CA. 2343  69.5500   NaN        S
868    male  NaN      0      0      345777   9.5000   NaN        S
878    male  NaN      0      0      349217   7.8958   NaN        S
888  female  NaN      1      2  W./C. 6607  23.4500   NaN        S

[177 rows x 12 columns]

In [21]:
age_avg=titanic_data["Age"].mean()
print(age_avg)

29.69911764705882

In [22]:
age_fare=titanic_data[["Age","Fare"]].median()
print(age_fare)

Age     28.0000
Fare    14.4542
dtype: float64

In [24]:
age_fare=titanic_data[["Age","Fare"]].describe()
print(age_fare)

              Age        Fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200